artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: "Warm up"
    - duration: 30
      arrivalRate: 20
      name: "Load test"
scenarios:
  - name: "Cached bike list and status checks"
    flow:
      - get:
          url: "/bikes?limit=10&page=1"
      - get:
          url: "/status"